{
    "title": "Equipment for pool freediving",
    "date": "2021-04-27",
    "text": "<p>Freediving is not an equipment-heavy sport, especially in the pool, but there a few things you need. In this post, I'll try and cover the minimum you need, using equipment you might have handy from other sports, and also some things to consider if you're looking to upgrade. I won't mention any particular brands/models though, there's plenty of reviews around and I think at that level of detail, what is best is very personal.</p>\n<h2>Mask or goggles</h2>\n<p>You need something to keep the water out of your eyes and nose. If you're starting out, a diving mask is fine. Any old mask will do, it doesn't have to be low volume (i.e., a freediving mask) because you don't need to equalise it.</p>\n<p>The alternative (and better option for most people) is to use swimming goggles. There is an incredible variety of goggles around, so you should be able to find a pair which are comfortable and work well (i.e., keep the water out) for your face shape. If you use goggles, then you also need to use a nose clip. Most divers will use a freediving nose clip because they grip really well and are comfortable. You can use a little swimming nose clip, but they tend to not have such a good grip, so it's easier to sniff a bit of water when you get a strong contraction, but if you have one that works well for you, there's no need to buy one just for freediving.</p>\n<h2>Fins</h2>\n<p>For dynamics and when safetying, you need fins. Any fins you have are good to start. For depth or competition, you'll probably wear freediving-specific fins, so you'll want to do most of your training in those. Freediving fins are usually long and soft (if you get a stiffness option, you probably want the softest there is for pool work, unless you are huge). Shorter fins seem to be coming in to fashion for pool competition - I'm not sure of the pros and cons to be honest. Some folk like to do some training in short (swimming) fins, it makes training a bit harder and it's good for your technique.</p>\n<p>Fins can be made of plastic, fibreglass, or carbon fibre (in increasing order of cost and quality). If you can afford it, getting a pair of fibreglass fins rather than plastic makes a big difference. The difference between carbon and fibre is not so big.</p>\n<p>Try on various fins to get a really comfortable, good-fitting foot pocket. For the pool, you don't want to have to wear socks (though it is fine if you want one pair of fins for the pool and ocean).</p>\n<p>If you'll use the fins in the ocean too, bare in mind that you'll want stiffer fins for depth and that carbon blades are super-fragile.</p>\n<p>A monofin is another possibility - it's the fastest, most efficient way to swim and lots of fun.</p>\n<h2>Wetsuit</h2>\n<p>To start, any wetsuit is fine. In fact you don't <em>need</em> a wetsuit, you can do dynamics in togs, though you might get a bit cold.</p>\n<p>A good wetsuit will keep you warm, but dynamics training is a pretty high activity level and swimming pools are pretty warm compared to the ocean, so you don't need to be too warm. A good fit and stretchy material will help keep you warm and improve your streamlining (easier to stretch your arms, less likely to fill up with water and balloon up), which means less water resistance and thus longer swims. The best kind of wetsuit is either a swimming wetsuit or a warm water freediving suit (2mm or 3mm).</p>\n<p>For statics, you aren't moving around so much so you will get colder, which means you need a thicker suit. A 5mm freediving suit is ideal. A good fit is important, a wetsuit which is too tight or letting in water, then it makes statics a lot less fun.</p>\n<h2>Weights</h2>\n<p>Buoyancy is critical for dynamics, especially no-fins. Not only do you need to be neutrally buoyant, but you need to have neutral trim, i.e., you need to float flat. If your buoyancy isn't perfect, then you'll be burning O2 to keep yourself in position and ruining your streamline by being at an angle.</p>\n<p>To start you just need enough weight to offset the buoyancy of your suit, either on your waist or neck. If you're taking things more seriously, you'll want to tweak the neck and waist weights to get perfect buoyancy.</p>\n<p>You need to make a neck weight, but it's not difficult. Most clubs have a bucket of them you can borrow from to start off. For a weight belt, get a stretchy rubber belt, it's much more comfy and it means the weights won't move around when you swim. Get small weights so you can adjust by small amounts, not by multiple kilos.</p>"
}
